# Основы работы с табличными данными

#### Полезные ссылки
1. https://pandas.pydata.org/docs/
2. https://matplotlib.org/stable/index.html

### Базовые преобразования данных

In [2]:
import pandas as pd
import matplotlib.pyplot as plt

df = pd.read_csv('data/test.csv')
df.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

##### 1.1 Выведите 15 последних строк датасета

In [ ]:
# Место для вашего кода :)

##### 1.2 Удалите колонки PassengerId, Ticket и Name

In [ ]:
# Место для вашего кода :)s

##### 1.3 Выведите количество пропущенных значений в каждом столбце.

In [ ]:
# Место для вашего кода :)

##### 1.4 Заполните пропуски в колонке Age средним значением, в колонке Embarked модой.

После этого удалите все строки, в которых всё ещё остались незаполненные поля.

Какими ещё значениями можно заменить пропуcки?

In [ ]:
# Место для вашего кода :)

##### 1.5 Добавье три новых бинарных признака: входит ли человек в группу от 20 до 35 лет, от 35 до 50, от 50 до 80.
##### Выведите количество объектов в каждой новой колонке.

In [ ]:
# Место для вашего кода :)

##### 1.6* Преобразование категориальных данных.
Как вы можете заметить по данным, существуют разные типы значений: категориальные и числовые (на самом деле, существуют и другие).
Для анализа данных принято категориальные значения приводить в числовой вид. Существуют различные способы таких преобразований.
Одни из самых простых - label encoding и one hot encoding.

1. Label encoding: каждому уникальному значению в колонке присваиваем собственный номер от 0 до (количество классов - 1) 
2. One hot encoding: пусть признак содержит n уникальных значений. Мы создаем n новых бинарных признаков, отражающих, имеется ли данный признак у объекта (1) или нет (0).
Пример:

(тут будет картинка)

В последующих занятиях мы детально разберем подобные преобразования и разницу между ними.

Теперь задание: создайте 2 новых датафрейма: one_hot_encoded_dataframe и label_encoded_dataframe, 
в которых категориальные признаки будут закодированы с помощью one hot encoding и label encoding соотствественно.

In [ ]:
one_hot_encoded_dataframe = ...
label_encoded_dataframe = ...

# Место для вашего кода :)

### Визуализация

##### 2.1 Для колонок Pclass, Sex, Age, Parch, Embarked постройте гистограмму с помощью matplotlib.

In [ ]:
# Место для вашего кода :)

##### 2.2 Постройте круговую диаграмму, отражающую распределение значений колонки Survived

In [ ]:
# Место для вашего кода :)